package kz.almaty.boombrains.files;

import java.util.ArrayList;
import java.util.Arrays;

public class RememberWordsKz {
    public static ArrayList<String> wordsKzList = new ArrayList<>(Arrays.asList(
            "абай","ағылшын","адал","айнадай","ақ","аққұба","ақсақ","ақшыл","ақылды","ақылы","ақымақ","ала","аласа","алғышқы",
            "алдыңғы","алқызыл","алтын","аман","аңқау","аппақ","ардақты","арзан","арнайы","артқы","артық","арық","атақты","аудандық",
            "ауру","ауыр","ашкөз","ашулы","ашушаң","ашық","ащы","аяулы","әдемі","әдепті","әділ","әйгілі","әлсіз","әмбебап","әр","әсем",
            "әуес","бай","байғұс","байсалды","байтақ","бақытсыз","бақытты","басқа","бастауыш","басты","басыңқы","батыл","батырлық",
            "бауырмал","баяғы","баяу","бейбіт","бейнелі","бейтаныс","берік","биік","боз","бойдақ","болашақ","болжалды","бос","бұзылған",
            "бұйра","бүкір","бүтін","білетін","білімді","білімсіз","бір","ғажайып","дайын","дана","дарынды","дәмді","дәмсіз","демалыс",
            "денелі","домалақ","дөңгелек","дөрекі","дұрыс","дымқыл","егде","ежелгi","емдік","еңбекқор","еңкіш","ерекше","ересек","еркiн",
            "ерте","ертеңгі","еріншек","есепшіл","ескі","жабайы","жабық","жағымды","жағымсыз","жазба","жазық","жай","жайлы","жақсы","жақын",
            "жалқау","жалпақ","жалпы","жаман","жаңа","жаңбырлы","жапон","жарқын","жарлы","жарық","жас","жасыл","жатық","жеке","желді",
            "желсіз","жеңіл","жеңілтек","жирен","жиі","жоғарғы","жолақ","жомарт","жөн","жуан","жуас","жұқа","жұмсақ","жүдеу","жылдам","жылы",
            "жіңішке","заңғар","зәулiм","зейінді","зиялы","зиянды","кәрі","кедей","кез","кекшіл","келбеттi","келесі","келісті","кең",
            "кепілдік","керемет","кешегі","кешкі","корей","көгілдір","көк","көктемгі","көне","көнерген","көңілді","көңілсіз","көпшіл",
            "күйеуге","күлгін","күлдіргі","күлкілі","күміс","күндізгі","күңгірт","күрделі","күткен","күтпеген","күшті","кірме","кіші",
            "қадiрлi","қажеттi","қазақ","қайнаған","қайырлы","қалалық","қалың","қамқор","қара","қараңғы","қараторы","қарлы","қарт","қасқа",
            "қатал","қате","қатты","қауiпсiз","қауiптi","қаhарман","қисық","қиын","қола","қолайлы","қонақжай","қоңыр","қос","қосымша","қою",
            "қу","қуанышты","құрама","құрғақ","құрмалас","құрметті","құтты","қызба","қызғылт","қызық","қызықсыз","қызықты","қызыл","қымбат",
            "қымбатты","қыңыр","қырғыз","қырсық","қысқа","қысқы","қышқыл","лас","майда","мақсатты","момын","мұңлы","мұртты","мүмкiн","мылжың",
            "мылқау","мырза","міндетті","нағыз","негізгi","неміс","ойлы","оң","оңай","ортақ","орталық","орыс","осындай","өжет","өзбек","өзекті",
            "өзімшіл","өзіндік","өкпелі","өткен","өткір","пайдалы","пысық","реттiк","риза","рухани","сабырлы","сабырсыз","сақ","сақалды","салқын",
            "салмақты","саңырау","сараң","сары","сау","сауатты","сәлемет","сәнді","сезімтал","семіз","сенгіш","сенімді","сирек","сол","соңғы",
            "сопақ","сөзуар","сөзшең","сулы","суық","сұйық","сұлу","сұр","сүйген","сүйкімді","сүйікті","сықылды","сымбатты","сынық","сыпайы",
            "табанды","таза","талғаулы","тамаша","таныс","таңғы","тар","тартымды","тату","таулы","таяз","тәкаппар","тәтті","тәуелсiз","тегін",
            "тегіс","темір","тентек","тең","терең","тиімді","тоқ","тоқыма","толқынды","толы","толық","томпақ","төменгі","туған","турашыл","тұзды",
            "тұйық","тұнық","тұңғиық","тұңғыш","тұрақты","тұщы","түзу","түнгі","түрлі","түскі","тынымды","тынымсыз","тыныш","тік","ұзақ","ұзын",
            "ұқыпты","ұлттық","ұлы","ұрысқақ","ұсақ","ұсқынсыз","ұстамды","ұялшақ","ұятсыз","үздік","үйленген","үлкен","хабарлы","шағын","шапшаң",
            "шаршы","шексіз","шетелдік","шикі","шын","ызақор","ызалы","ылғалды","ыңғайлы","ыңғайсыз","ыстық","ілулі","ірі","іскер","ішкі"
    ));
}
