package kz.almaty.boombrains.util.files;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

import kz.almaty.boombrains.R;

public class RememberWordsRu {
    public static ArrayList<String> wordsRuList = new ArrayList<>(Arrays.asList(
            "говорить","человека","довольно","господин","особенно","казалось","иванович","которого","говорила","например","несмотря","спросила",
            "говорили","вскричал","павлович","напротив","петрович","прибавил","двадцать","хотелось","ивановна","голядкин","отвечала","известно",
            "закричал","смотреть","говорите","петровна","лизавета","разговор","произнес","вероятно","бросился","катерина","серьезно","взглядом",
            "медленно","никакого","человеку","прощайте","взглянул","извините","спросить","смотрела","маменька","сударыня","государь","которому",
            "вспомнил","квартиру","голубчик","очевидно","отвечает","сомнения","настасья","повторил","напрасно","заметила","спокойно","послушай",
            "генерала","поскорее","смотрите","невольно","покамест","здоровье","говоришь","григорий","внимание","заметить","поглядел","внезапно",
            "счастлив","странное","отвечать","чувствую","внимания","простите","третьего","характер","оставить","павловна","тридцать","делается",
            "немножко","показать","поспешно","встретил","обломова","приходил","наденька","лестнице","навсегда","чувством","осталось","раздался",
            "крестьян","чиновник","жениться","извольте","человек","наконец","говорит","говорил","сказать","никогда","кажется","впрочем","который",
            "конечно","спросил","сказала","которые","сегодня","отвечал","слишком","сколько","обломов","заметил","которой","стороны","образом",
            "говорят","подумал","немного","глазами","господа","которая","пожалуй","генерал","которых","времени","которую","дядюшка","крайней",
            "комнате","сделать","нарочно","комнату","неужели","понимаю","молодой","смотрел","голосом","головой","главное","сначала","господи",
            "странно","котором","ромашов","которое","другого","сторону","комнаты","большой","женщина","николай","крикнул","батюшка","ответил",
            "вечером","столько","которым","страшно","дескать","наверно","первого","виноват","чичиков","однажды","матушка","скажите","подошел",
            "варвара","думаете","всякого","счастье","решился","приехал","мальчик","степени","слезами","гораздо","чувства","алексей","улыбкой",
            "чувство","капитан","сказали","женщины","старуха","хочется","дмитрий","постели","радости","хозяйка","остался","следует","схватил",
            "теперь","сказал","нибудь","ничего","потому","совсем","всегда","хорошо","сейчас","тотчас","другой","больше","сердце","минуту","говорю",
            "своего","именно","голову","прежде","почему","иногда","знаете","нельзя","однако","вместе","правда","просто","иваныч","делать","завтра",
            "деньги","одного","самого","ужасно","знаешь","весьма","отчего","письмо","быстро","первый","любовь","такого","руками","каждый","словом",
            "старик","значит","какого","вперед","рублей","должен","хотите","пришел","нечего","сделал","должно","случае","вопрос","степан","хочешь",
            "давеча","против","другое","других","десять","взгляд","бывало","глазах","голова","видишь","своему","сердца","другие","видеть","четыре",
            "слышал","начала","своими","вместо","сильно","кругом","минуты","вообще","голове","видите","крепко","первых","оттого","увидел","нашего",
            "всякий","хотела","далеко","узнать","матери","случай","откуда","другую","любить","когда","вдруг","может","очень","опять","потом",
            "тогда","будто","этого","чтобы","время","будет","какой","почти","здесь","после","глаза","всего","более","можно","такой","своей",
            "князь","между","много","перед","точно","такое","лучше","жизнь","зачем","хотел","какая","слова","через","стало","давно","начал",
            "знает","жизни","разве","прямо","долго","самом","думал","какие","какое","назад","своим","алеша","своих","нужно","одной","таким",
            "думаю","каким","людей","пошел","вовсе","слово","такие","пусть","дверь","никто","такая","видел","скоро","мысль","вчера","знать",
            "право","своем","любви","место","одним","часто","видно","кроме","стоял","голос","тобой","моего","могла","вышел","люблю","скажу",
            "стоит","свете","собою","денег","домой","собой","самое","франц","верно","какую","самый","места","помню","никак"
    ));

    public static ArrayList<String> letterRUList = new ArrayList<>(Arrays.asList(
            "А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л",
            "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш",
            "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я"
    ));

    public static List<Integer> list_on = new ArrayList<>(Arrays.asList(
            R.drawable.achieve_1_on, R.drawable.achieve_2_on, R.drawable.achieve_3_on,
            R.drawable.achieve_4_on, R.drawable.achieve_5_on, R.drawable.achieve_6_on,
            R.drawable.achieve_7_on, R.drawable.achieve_8_on, R.drawable.achieve_9_on,
            R.drawable.achieve_10_on, R.drawable.achieve_11_on, R.drawable.achieve_12_on
    ));

    public static List<Integer> list_off = new ArrayList<>(Arrays.asList(
            R.drawable.achieve_1_of, R.drawable.achieve_2_of, R.drawable.achieve_3_of,
            R.drawable.achieve_4_of, R.drawable.achieve_5_of, R.drawable.achieve_6_of,
            R.drawable.achieve_7_of, R.drawable.achieve_8_of, R.drawable.achieve_9_of,
            R.drawable.achieve_10_of, R.drawable.achieve_11_of, R.drawable.achieve_12_of
    ));
}
